<div class="col-3 catalog-container">
    <h4>Для кошек</h4>
    <a href="catalog.php">
        <h6>Корм</h6>
    </a>
    <a href="#">
        <h6>Миски</h6>
    </a>
    <a href="#">
        <h6>Лежанки и домики</h6>
    </a>
    <a href="#">
        <h6>Средства для ухода</h6>
    </a>
    <a href="#">
        <h6>Амуниция</h6>
    </a>
    <a href="#">
        <h6>Туалеты</h6>
    </a>
    <a href="#">
        <h6>Игрушки</h6>
    </a>

    <h4 class="mt-4">Для собак</h4>
    <a href="#">
        <h6>Корм</h6>
    </a>
    <a href="#">
        <h6>Миски</h6>
    </a>
    <a href="#">
        <h6>Лежанки и домики</h6>
    </a>
    <a href="#">
        <h6>Средства для ухода</h6>
    </a>
    <a href="#">
        <h6>Одежда и обувь</h6>
    </a>
    <a href="#">
        <h6>Амуниция</h6>
    </a>
    <a href="#">
        <h6>Игрушки</h6>
    </a>

    <h4 class="mt-4">О нас</h4>
    <a href="#">
        <h6>Доставка и оплата</h6>
    </a>
    <a href="#">
        <h6>Контакты</h6>
    </a>
</div>